# 1. Создайте файл lesson_2_task_6.py.
# 2. Дан список lst = [11, 5, 8, 32, 15, 3, 20, 132, 21, 4, 555, 9, 20].
# 3. Необходимо вывести элементы, которые одновременно:
#     a. меньше 30,
#     b. делятся на 3 без остатка.


lst = [11, 5, 8, 32, 15, 3, 20, 132, 21, 4, 555, 9, 20]
new_lst = []

for l in lst:
    if (l < 30 and l % 3 == 0):
        new_lst.append(l)
        
        
print(new_lst)